Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Now we can create our Servlet `org.acme.greeting.extension.GreetingExtensionServlet` in the `runtime` module.
ja_jp: これで、 `runtime` モジュールでサーブレット `org.acme.quarkus.greeting.GreetingServlet` を作成することができるようになりました。

source: Now we can generate a JWT to use with `TokenSecuredResource` endpoint. To do this, run the following command:
ja_jp: これで、 `TokenSecuredResource` エンドポイントで使用する JWT を生成できます。これを行うには、次のコマンドを実行します。

source: Now we can see the Quarkus events per thread.
ja_jp: これで、スレッドごとに Quarkus イベントを表示できます。

source: Now we configure the maven-assembly-plugin to create a Zip and a Tar file containing the executable and any supporting files it may need to perform its job. Take special note on the name of the distribution, this is where we make use of the platform properties detected by the os-detector-maven-plugin. This plugin is configured in its own profile with the `single` goal bound to the `package` phase. It's done this way to avoid rebuilding the distribution every single time the build is invoked, as we only needed when we're ready for a release.
ja_jp: ここで、maven-assembly-pluginを設定し、実行ファイルとその作業を実行するために必要なサポートファイルを含むZipファイルとTarファイルを作成します。 これは、os-detector-maven-pluginによって検出されたプラットフォームのプロパティを使用する場所です。 このプラグインは、 `single` ゴールが `package` フェーズにバインドされた独自のプロファイルで構成されます。これは、ビルドが呼び出されるたびにディストリビューションを再ビルドするのを避けるためです。

source: Now we configure the maven-assembly-plugin to create a Zip and a Tar file containing the executable and any supporting files it may need to perform its job. Take special note on the name of the distribution, this is where we make use of the platform properties detected by the os-maven-plugin. This plugin is configured in its own profile with the `single` goal bound to the `package` phase. It's done this way to avoid rebuilding the distribution every single time the build is invoked, as we only needed when we're ready for a release.
ja_jp: 次に、maven-assembly-plugin を設定して、実行可能ファイルと、そのジョブを実行するために必要になる可能性のあるサポートファイルを含む Zip ファイルと Tar ファイルを作成します。ディストリビューションの名前に特に注意してください。ここで、os-maven-plugin によって検出されたプラットフォームのプロパティーを利用します。このプラグインは、 `package` フェーズにバインドされた `single` ゴールを使用して独自のプロファイルで設定されます。これは、リリースの準備ができたときにのみ必要になるため、ビルドが呼び出されるたびにディストリビューションを再ビルドすることを回避するためにこのように行われます。

source: Now we define another bean that will implement `StringFunction` using Spring's stereotype annotation style. This bean will effectively be a no-op bean that simply returns the input as is. Create a `src/main/java/org/acme/spring/di/NoOpSingleStringFunction.java` file and set the following content:
ja_jp: 次に、Springのステレオタイプアノテーションスタイルを使用して、 `StringFunction` を実装する別のBeanを定義します。このBeanは、事実上、入力をそのまま返すだけのno-op beanとなります。 `src/main/java/org/acme/spring/di/NoOpSingleStringFunction.java` ファイルを作成し、以下の内容を設定します:

source: Now we have defined our profile we need to include it on our test class. We do this by annotating the test class with `@TestProfile(MockGreetingProfile.class)`.
ja_jp: これでプロファイルを定義したので、それをテストクラスに含める必要があります。そのためには、テストクラスに `@TestProfile(MockGreetingProfile.class)` アノテーションを付けます。

source: Now we have three properties in our `GreetingProperties` class. While `name` could be considered more of a runtime property (and maybe could be passed as an HTTP query parameter in the future), `text` and `suffix` are used to define a message template. Let's group these two properties in a separate inner class:
ja_jp: これで、 `GreetingProperties` クラスに3つのプロパティができました。 `name` はどちらかというと実行時のプロパティと考えられますが（将来的には HTTP クエリパラメータとして渡すことができるかもしれません）、 `text` と `suffix` はメッセージテンプレートの定義に使用されます。この2つのプロパティを別のインナークラスにまとめてみましょう:

source: Now we need to add JaCoCo to our project. To do this we need to add the following to the build file:
ja_jp: 次に、Jacocoをプロジェクトに追加する必要があります。そのために、ビルドファイルに以下を追加する必要があります:

source: Now we need to add Jacoco to our project. To do this we need to add the following to the build file:
ja_jp: 次に、Jacocoをプロジェクトに追加する必要があります。これを行うには、ビルドファイルに以下を追加する必要があります:

source: Now we need to configure Stork for using Kubernetes to discover the red and blue instances of the service.
ja_jp: 次に、Kubernetes を使用してサービスの Blue と Red のインスタンスを検出するように Stork を設定する必要があります。

source: Now we'll be adding all the elements necessary to have an application that is properly covered with tests.
ja_jp: ここで、アプリケーションをテストで適切にカバーするために必要な要素をすべて追加していきます。

source: Now when you run `jbang quarkusapp.java` you can check what the new end point returns:
ja_jp: jbang quarkusapp.java` を実行すると、新しいエンドポイントが返す内容を確認することができます。

source: Now when you run the application you will see Quarkus start up.
ja_jp: アプリケーションを実行すると、 Quarkus が起動するのを確認することができます。

source: Now when you run the native build all these files will be included within `function.zip`
ja_jp: ネイティブビルドを実行すると、これらのファイルはすべて `function.zip` に含まれます。

source: Now when you run with `jbang quarkusapp.java` the end point should return what you expect:
ja_jp: `jbang quarkusapp.java` を実行すると、エンドポイントは期待通りの値を返すようになったことが確認できます。

source: Now you are ready to have users authenticated with Google and support updating their `Google` calendars on their behalf, for example:
ja_jp: これで、ユーザーをGoogleで認証させ、例えば彼らの代わりに `Google` カレンダーの更新をサポートする準備が整いました：

source: Now you are ready to put everything together and create a REST service. But solving planning problems on REST threads causes HTTP timeout issues. Therefore, the Quarkus extension injects a `SolverManager` instance, which runs solvers in a separate thread pool and can solve multiple datasets in parallel.
ja_jp: これで、すべてをまとめて REST サービスを作成する準備が整いました。ただし、REST スレッドの planning problem を解決すると、HTTP タイムアウトの問題が発生します。したがって、Quarkus エクステンションは `SolverManager` インスタンスを挿入します。これにより、別のスレッドプールでソルバーが実行され、複数のデータセットを並行して解決できます。

source: Now you are ready to start testing the endpoint.
ja_jp: これで、エンドポイントのテストを開始する準備が完了しました。

source: Now you are ready to use OIDC Dev UI with Auth0.
ja_jp: これで Auth0 で OIDC Dev UI を使用する準備が完了しました。

source: Now you can access both MTLS and OIDC security identities as follows:
ja_jp: 次のようにして、MTLS と OIDC の両方のセキュリティーアイデンティティーにアクセスできるようになりました。

source: Now you can access the assistant state anywhere in your page, and when that state changes it will act exactly the same as a local state - re-render the relevant parts of the page:
ja_jp: これで、ページのどこからでもアシスタントの状態にアクセスできるようになります。その状態が変化すると、ローカルの状態とまったく同じように動作し、ページの関連部分が再レンダリングされます:

source: Now you can access the assistant state anywhere in your page, and when that state changes, it will act exactly the same as a local state - re-render the relevant parts of the page:
ja_jp: これで、ページのどこからでもアシスタントの状態にアクセスできるようになります。その状態が変化すると、ローカルの状態とまったく同じように動作し、ページの関連部分が再レンダリングされます。

source: Now you can access the connection state anywhere in your page, and when that state changes it will act exactly the same as a local state - re-render the relevant parts of the page:
ja_jp: これで、ページのどこからでも接続状態にアクセスできるようになり、その状態が変化すると、ローカルの状態とまったく同じように動作し、ページの関連部分が再レンダリングされます:

source: Now you can access the theme state anywhere in your page, and when that state changes it will act exactly the same as a local state - re-render the relevant parts of the page:
ja_jp: これで、ページのどこからでもテーマ状態にアクセスできるようになり、その状態が変化すると、ローカルの状態とまったく同じように動作し、ページの関連部分が再レンダリングされます:

source: Now you can fill in your application name, your support email, your developer contact information and press `SAVE AND CONTINUE`:
ja_jp: これで、アプリケーション名、サポートメール、開発者の連絡先情報を入力して、 `SAVE AND CONTINUE` を押すことができます。

source: Now you can get the current theme, so add the `theme` property to your code block, example:
ja_jp: これで現在のテーマを取得できるようになりました。次の例のように、コードブロックに `theme` プロパティーを追加します。

source: Now you can push your application to Heroku and open it in your browser.
ja_jp: これで、アプリケーションを Heroku にプッシュし、ブラウザーで開くことができます。

source: Now you can rebuild the docker image:
ja_jp: これでdockerイメージをリビルドすることができます。

source: Now you can start making changes to your application. Go into the `GreetingResource` and change the hello endpoint to return `"hello world"`, and save the file. Quarkus should immediately re-run the test, and you should get output similar to the following:
ja_jp: これで、アプリケーションの変更を開始できます。 `GreetingResource` を開き、helloエンドポイントを `"hello world"` を返すように変更し、ファイルを保存します。Quarkusはすぐにテストを再実行し、以下のような出力が得られるはずです。

source: Now you can start your application and Quarkus will run the Flyway's migrate method according to your config.
ja_jp: これでアプリケーションを起動でき、Quarkus は設定に従って Flyway のマイグレーションメソッドを実行します。

source: Now you can start your application and Quarkus will run the Flyway's migrate method according to your config:
ja_jp: これでアプリケーションを起動でき、Quarkus は設定に従って Flyway のマイグレーションメソッドを実行します。

source: Now you can start your application and Quarkus will run the Liquibase's update method according to your config.
ja_jp: これで、アプリケーションを起動できるようになり、Quarkusは設定に従ってLiquibaseのアップデートメソッドを実行します。

source: Now you can start your application and Quarkus will run the Liquibase's update method according to your config:
ja_jp: これでアプリケーションを起動することが出来るようになり、Quarkusはあなたの設定に従ってLiquibaseの更新メソッドを実行します:

source: Now you can use curl commands to interact with the underlying REST API.
ja_jp: これで、curl コマンドを使用して、基盤となる REST API と対話できます。

source: Now you can use the AWS console to view and test your new lambda function.
ja_jp: これで、AWS コンソールを使用して、新しいラムダ関数を表示およびテストできます。

source: Now you can use the JsonRPC controller to access the `getAll` method (and any other methods in your JsonRPC Service)
ja_jp: これで、JsonRPC コントローラーを使用して `getAll` メソッド (および JsonRPC サービス内の他のメソッド) にアクセスできるようになりました。

source: Now you do not need to use the `@Operation` annotation. While generating the document, the method name will be used for the Operation Id.
ja_jp: これで、 `@Operation` アノテーションを使用する必要はありません。ドキュメントの生成時には、メソッド名がオペレーションIDとして使用されます。

source: Now you have all the benefits of https://quarkus.io/guides/maven-tooling#dev-mode[Quarkus Dev Mode^] and https://quarkus.io/guides/continuous-testing[Quarkus Continuous Testing^] across the entire application at once! All backing infrastructure (databases, Kafka, Apicurio) is provisioned for you automatically by https://quarkus.io/guides/dev-services[Quarkus Dev Services^].
ja_jp: これで、アプリケーション全体で link:https://quarkus.io/guides/maven-tooling#dev-mode[Quarkus Dev Mode, window=_blank]と link:https://quarkus.io/guides/continuous-testing[Quarkus Continuous Testing, window=_blank]のすべてのメリットを一度に得られるようになりました。すべてのバッキングインフラ（データベース、Kafka、Apicurio）は、 link:https://quarkus.io/guides/dev-services[Quarkus Dev Services, window=_blank]によって自動的にプロビジョニングされます。

source: Now you may still be asking yourself "Why STM instead of JTA?" or "What are the benefits to STM that I don't get from JTA?" Let's try to answer those or similar questions, with a particular focus on why we think they're great for Quarkus, microservices and Kubernetes native applications. So in no specific order ...
ja_jp: 今、あなたはまだ「なぜJTAではなくSTMなのか?」や「JTAでは得られないSTMのメリットは何か?」と自問自答しているかもしれません。ここでは、Quarkus、マイクロサービス、Kubernetesネイティブアプリケーションに最適だと思う理由を中心に、これらの質問や似たような質問に答えてみましょう。ということで、順不同で ...

source: Now you need to connect your local agent to the remote host, using the `remote-dev` command:
ja_jp: ここで、 `remote-dev` コマンドを使用し、ローカルエージェントをリモートホストに接続する必要があります。

source: Now, Kubernetes will validate all the incoming connections using SSL with the certificates provided within the secret with name "my-secret".
ja_jp: これで、Kubernetes は、my-secret という名前のシークレット内で提供された証明書を使用して、SSL を使用してすべての着信接続を検証します。

source: Now, a request to `/q/openapi` endpoint will serve the static OpenAPI document instead of the generated one.
ja_jp: これで、 `/q/openapi` エンドポイントへのリクエストは、生成されたものではなく静的な OpenAPI ドキュメントを提供するようになりました。

source: Now, all the REST Clients will be using your custom HTTP Client Options.
ja_jp: これで、すべてのRESTクライアントが、あなたのカスタムHTTPクライアントオプションを使用するようになります。

source: Now, all the REST Clients will be using your custom redirect handler.
ja_jp: これで、すべての REST Client が、お客様のカスタムリダイレクトハンドラーを使用するようになります。

source: Now, as an added benefit, you can also access the repository using a handy shortcut generated static method on the https://docs.jboss.org/hibernate/orm/7.1/introduction/html_single/Hibernate_Introduction.html#static-metamodel[generated Metamodel] of your entity, which is super useful for discovery of operations (just type `Cat_.repo().` and see all your methods) and to avoid making a detour outside of your method to add an injected field, such as in this startup code that will delete all your cats (don't do this in production!!):
ja_jp: さらに、生成されたエンティティの https://docs.jboss.org/hibernate/orm/7.1/introduction/html_single/Hibernate_Introduction.html#static-metamodel[生成されたメタモデル] にある便利なショートカット生成静的メソッドを使用してリポジトリにアクセスすることもできます。これは、操作の発見に非常に役立ち (単に `Cat_.repo().` と入力してすべてのメソッドを確認する)、メソッドの外部でインジェクトされたフィールドを追加する回り道を避けるためにも便利です。この起動コードのように、すべての猫を削除する例があります (本番環境では行わないでください!!):

source: Now, clear the browser cookie cache, access http://localhost:8080/hello again, authenticate to Auth0 and get an expected user name.
ja_jp: ブラウザーの Cookie キャッシュをクリアし、再度 http://localhost:8080/hello にアクセスし、Auth0 に対して認証して期待されるユーザー名を取得します。

source: Now, clear the browser cookie cache, access http://localhost:8080/hello, login to Quarkus with Auth0, get the user name returned, and go to `http://localhost:8080/logout`. You'll see the `You were logged out` message displayed in the browser.
ja_jp: ここで、ブラウザーの Cookie キャッシュをクリアし、 http://localhost:8080/hello にアクセスし、Auth0 で Quarkus にログインしてユーザー名を取得し、 `http://localhost:8080/logout` に移動します。ブラウザーには、 `You were logged out` というメッセージが表示されます。

source: Now, configure the Quarkus OIDC `web-app` application to point to the Keycloak `quarkus` realm, `quarkus.oidc.auth-server-url=http://localhost:8180/realms/quarkus`. Then, you are ready to start authenticating your Quarkus users to the Okta SAML 2.0 provider by using an OIDC to SAML bridge that is provided by Keycloak OIDC and Okta SAML 2.0 providers.
ja_jp: ここで、Quarkus OIDC `web-app` アプリケーションを、Keycloak `quarkus` レルム `quarkus.oidc.auth-server-url=http://localhost:8180/realms/quarkus` を指すように設定します。 次に、Keycloak OIDC および Okta SAML 2.0 プロバイダーによって提供される OIDC から SAML へのブリッジを使用して、Quarkus ユーザーを Okta SAML 2.0 プロバイダーに認証する準備が整います。

source: Now, create the `org.acme.elasticsearch.FruitResource` class as follows:
ja_jp: では、次のように `org.acme.elasticsearch.FruitResource` クラスを作成します:

source: Now, create the `org.acme.mongodb.FruitResource` class as follows:
ja_jp: では、次のように `org.acme.mongodb.FruitResource` クラスを作成します。

source: Now, create the `org.acme.rest.json.FruitResource` class as follows:
ja_jp: 次に、 `org.acme.rest.json.FruitResource` クラスを以下のように作成します。

source: Now, create the `src/main/java/org/acme/TheBestPlaceToBeResource.java` class with the following content:
ja_jp: 次に、以下の内容で `src/main/java/org/acme/TheBestPlaceToBeResource.java` クラスを作成します：

source: Now, finish creating the application by adding `FrontendResource`:
ja_jp: 次に、 `FrontendResource` を追加してアプリケーションの作成を完了します。

source: Now, follow the steps below to import the realms for the two tenants:
ja_jp: さて、以下の手順に従って、2つのテナントのためのレルムをインポートします。

source: Now, having a dependency activating condition in the descriptor of `quarkus-extension-b`, other extensions may declare a conditional dependency on it.
ja_jp: さて、 `quarkus-extension-b` の記述子に依存関係有効化条件があると、他のエクステンションが条件付きの依存関係を宣言することができます。

source: Now, having a dependency condition recorded in the descriptor of the `quarkus-extension-b`, other extensions may declare a conditional dependency on it.
ja_jp: これで、 `quarkus-extension-b` の記述子に依存条件が記録されたので、他のエクステンションはそれに対する条件付き依存を宣言できるようになります。

source: Now, hit `s` in your dev mode session, to force a full restart. Then visit http://localhost:8080/hello/names.
ja_jp: 次に、開発モードセッションで `s` を押して、強制的に完全に再起動します。続いて、 http://localhost:8080/hello/names にアクセスします。

source: Now, however, we were in the situation where paths weren't being resolved as people expected, and the configuration changes required to resolve that situation either weren't intuitive or lead to other problems. We ended up putting all of the possible configuration permutations into a spreadsheet so we could see side by side what happened when you combined different configuration values. The results were not awesome. However, the exercise allowed us to step back and look at the big picture to evaluate what needed to change to allow application and non-application endpoints to behave as you need them to.
ja_jp: しかし、人々が期待していた通りにパスが解決されず、その状況を解決するために必要な設定の変更が直感的ではなかったり、別の問題を引き起こしたりする状況に陥りました。そこで私たちは、異なる設定値を組み合わせたときに何が起こるかを並べて見ることができるように、すべての可能な設定の組み合わせをスプレッドシートに入れてみました。結果はそれほど素晴らしいものではありませんでした。しかし、この演習により、アプリケーションと非アプリケーションのエンドポイントが必要な動作をするようにするために何を変更する必要があるかを評価するために、一歩下がって全体像を見ることができました。

source: Now, if a user or even some other extension needs to override the default implementation of the `Parser` the simplest solution is to use CDI `@Alternative` + `@Priority`:
ja_jp: さて、ユーザーや他のエクステンションが `Parser` のデフォルトの実装を上書きする必要がある場合、最も簡単な解決策は CDI `@Alternative` + `@Priority` を使用することです。

source: Now, if that `@Traced` interceptor also performed all the necessary logging, we'd like to skip the `@Logged` interceptor for this method, but keep it for all other methods. To achieve that, you can annotate the method with `@NoClassInterceptors`:
ja_jp: もし `@Traced` インターセプターが必要なロギングもすべて行っていた場合、このメソッドでは `@Logged` インターセプターを省略したいのですが、他のすべてのメソッドではそのままにしておきたいと思います。これを実現するには、メソッドに `@NoClassInterceptors` というアノテーションを付けます。

source: Now, if you decided to use OIDC Database Token State Manager, you must add the following dependencies and set a reactive driver URL:
ja_jp: ここで、OIDC Database Token State Manager を使用することにした場合は、次の依存関係を追加し、リアクティブドライバー URL を設定する必要があります。

source: Now, if you want to retrieve or delete, using the programmatic API, a cache value that was stored using the annotations API, you just need to make sure the same key is used with both APIs.
ja_jp: アノテーションAPIを使って保存されたキャッシュ値を、プログラムAPIを使って取得または削除したい場合、両方のAPIで同じキーが使われていることを確認する必要があります。

source: Now, import the realms for the two tenants:
ja_jp: 次に、2 つのテナントのレルムをインポートします。

source: Now, in the `quarkus` realm properties, navigate to `Identity Providers` and add a new SAML provider:
ja_jp: 次に、 `quarkus` レルムのプロパティーで、 `Identity Providers` に移動し、新しい SAML プロバイダーを追加します。

source: Now, in your Runtime module, create the JsonRPC Service. This class will default to an application-scoped bean, except if you explicitly scope the bean. All public methods that return something will be made available to call from the Web component Javascript.
ja_jp: 次に、ランタイムモジュールで JsonRPC サービスを作成します。このクラスは、Bean を明示的にスコープ指定しない限り、デフォルトでアプリケーションスコープの Bean になります。何かを返すすべてのパブリックメソッドは、Web コンポーネントの Javascript から呼び出すことができるようになります。

source: Now, in your code, the only differences with a regular managed session entity are:
ja_jp: さて、コードでは、通常の管理対象セッションエンティティーとの唯一の違いは次のとおりです。

source: Now, in your code, you can create an instance of `WebClient`:
ja_jp: これで、コードの中で、 `WebClient` のインスタンスを作成することが可能です。

source: Now, in your terminal, run
ja_jp: 次に、ターミナルで以下を実行します。

source: Now, it's time to send a record to Kafka. Create the `org.acme.MovieProducer` class with the following content:
ja_jp: さて、いよいよKafkaにレコードを送信します。以下の内容で `org.acme.MovieProducer` クラスを作成します:

source: Now, it's time to send messages. Create the `org.acme.MovieProducer` class with the following content:
ja_jp: さて、いよいよメッセージを送信する時が来ました。以下の内容で `org.acme.MovieProducer` クラスを作成します:

source: Now, let us add a simple web page to display our list of legumes. In the `src/main/resources/META-INF/resources` directory, add a `legumes.html` file with the content from this {quickstarts-blob-url}/rest-json-quickstart/src/main/resources/META-INF/resources/legumes.html[legumes.html] file in it.
ja_jp: ここで、マメ科植物のリストを表示するための簡単なウェブページを追加してみましょう。 `src/main/resources/META-INF/resources` ディレクトリーに、この {quickstarts-blob-url}/rest-json-quickstart/src/main/resources/META-INF/resources/legumes.html[legumes.html] ファイルの内容を含む `legumes.html` ファイルを追加します。

source: Now, let's change the REST service URL to **not** use SSL in `src/main/resources/application.properties`:
ja_jp: では、 `src/main/resources/application.properties` でRESTサービスのURLを変更して、SSLを使用し *ない* ように変更してみましょう:

source: Now, let's create our first GraphQL API.
ja_jp: それでは、最初のGraphQL APIを作成してみましょう。

source: Now, let's have a look at the memory consumption. Start the application using:
ja_jp: では、メモリの消費量を見てみましょう。次のコマンドを使ってアプリケーションを起動します。

source: Now, let's just check the size of our native executable as it will be useful later:
ja_jp: ここで、あとで役立つので、ネイティブ実行可能ファイルのサイズを確認してみましょう:

source: Now, let's remove the `index.html` from `resources/META-INF/resources` or it will be picked up instead of your Function.
ja_jp: ここで、 `resources/META-INF/resources` から `index.html` を削除しましょう。そうしないと、関数の代わりに選択されてしまいます。

source: Now, let's see our application in action. Run it with:
ja_jp: では、実際にアプリケーションを見てみましょう。以下のように実行してみてください:

source: Now, let's try a to hit a protected resource anonymously.
ja_jp: では、匿名で保護されたリソースを攻撃してみましょう。

source: Now, let's try to hit a protected resource anonymously.
ja_jp: では、匿名で保護されたリソースを攻撃してみましょう。

source: Now, let's use this to make a secured request to the `/secured/roles-allowed` endpoint. Make sure you have the Quarkus server still running in dev mode, and then run the following command, making sure to use your version of the generated JWT from the previous step:
ja_jp: ここで、これを使用して、 `/secured/roles-allowed` エンドポイントにセキュリティー保護されたリクエストを送信してみましょう。 Quarkus サーバーが開発モードで実行されていることを確認してから、次のコマンドを実行し、前の手順で生成された JWT のバージョンを必ず使用します。

source: Now, modify the `hello` method to use the injected properties:
ja_jp: ここで、 `hello` メソッドを修正して、注入されたプロパティーを使用します:

source: Now, open the main link:http://localhost:8080/q/dev[Dev UI page] and observe the *OpenID Connect* card linking to a Keycloak page. For example:
ja_jp: 次に、メインの link:http://localhost:8080/q/dev[Dev UI ページ] を開き、Keycloak ページにリンクしている *OpenID Connect* カードを確認します。 次に例を示します。

source: Now, open your browser to http://localhost:8080/async/Quarkus, and you should see:
ja_jp: ブラウザで http://localhost:8080/async/Quarkus を開くと、以下が表示されます。

source: Now, run `jbang quarkusapp.java` and you will see JBang resolving this dependency and building the jar with help from Quarkus' JBang integration.
ja_jp: ここで `jbang quarkusapp.java` を実行すると、 `jbang` がこの依存関係を解決し、Quarkus の jbang 統合の機能を利用して jar をビルドしていることがわかります。

source: Now, running the command `curl http://localhost:8080/increments/first` should return the following result:
ja_jp: さて、コマンドを実行すると `curl http://localhost:8080/increments/first` は次のような結果を返します:

source: Now, running the command `curl http://localhost:8080/increments` should return an empty list `[]`
ja_jp: さて、コマンドを実行すると `curl http://localhost:8080/increments` は空のリスト `[]` を返します

source: Now, set the configuration and write the test code the same way as it is described in the <<code-flow-integration-testing-wiremock,Wiremock>> section. The only difference is the name of `QuarkusTestResource`:
ja_jp: 次に、設定を行い、<<code-flow-integration-testing-wiremock,Wiremock>> セクションに説明されているのと同じ方法でテストコードを記述します。 唯一の違いは `QuarkusTestResource` の名前です。

source: Now, start the application in the dev mode with `mvn quarkus:dev`.
ja_jp: ここで、 `mvn quarkus:dev` を使用して開発モードでアプリケーションを起動します。

source: Now, the endpoints `/records` and `/records/first` will accept the media type both `json` and `hal+json` to print the records in Hal format.
ja_jp: これで、エンドポイント `/records` と `/records/first` は、メディアタイプ `json` と `hal+json` の両方を受け入れ、HAL 形式のレコードを表示します。

source: Now, the endpoints `/records` and `/records/first` will accept the media type, both `json` and `hal+json`, to print the records in Hal format.
ja_jp: これで、エンドポイント `/records` と `/records/first` は、`json` と `hal+json` の両方のメディアタイプを受け入れ、レコードを Hal 形式で出力するようになります。

source: Now, the endpoints `/records` and `/records/{id}` will accept the media type both `json` and `hal+json` to print the records in Hal format.
ja_jp: ここで、エンドポイント `/records` と `/records/{id}` は、 `json` と `hal + json` の両方のメディアタイプを受け入れて、Hal 形式でレコードを出力します。
